static声明变量为静态变量，同时限定该变量的作用域，如果在还是内部，则跳出此函数后，则无法使用该变量，若在某个源文件内，则其他源文件无法使用该变量。
函数内部的临时变量在跳出函数后被销毁，RAM空间被释放，但是如果加上static修饰，则该变量在函数执行结束后仍然存在，下次进入该函数时，变量会保存上一次
函数执行结束时的值，只有复位或重新启动后变量才会复位，与全局变量类似，但是与全局变量不同的是，该静态变量的使用范围被限制，只在函数内部有效。
一般书写格式：

static int a = 0;

还有另外一只不太常见的写法：

int static a = 0;
这个写法有些编译器是不支持的，会提示警告或者错误
程序编写是最好使用一般的书写格式，喜闻乐见。

另外static还可以用用来修饰函数，用以限制函数的作用域，其效果与修饰变量一样。

extern 是用于外部声明时使用，编写C代码时无论是函数还是变量，都需要先声明/定义后使用，定义就是给一个具体的实体，声明就是说明一些有“这个东西”，但是没有给
“这个东西”以实体，那用extern来进行声明有什么好处呢，简单来说就是一处定义后，任何想使用的地方只要通过extern声明一下就可以使用了。
例如：
int a = 0;

...

在其他文件中使用：
extern int a;

if(1 != a)
{
  a = 1;
}
else
{
}

记住无论有多少个extern声明，一定要有一处进行定义，否则编译器找不到实体，会提示你使用了未定义的变量。
